;******************************************************************************
;* TI ARM C/C++ Codegen                                      Unix v18.1.4.LTS *
;* Date/Time created: Fri Feb 15 14:11:24 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=none --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("package/cfg/hello_pem3.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v18.1.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/Users/hunteradams/Documents/MSP430/workspace/Monarch/Debug/configPkg")

;*****************************************************************************
;* FUNCTION SYNONYMS                                                         *
;*****************************************************************************
	.symalias ResetISR, _c_int00
	.global	malloc
malloc	.set ti_sysbios_rts_gnu_MemAlloc_alloc
	.global	ti_sysbios_knl_Intrinsics_SupportProxy_Module__startupDone__S

	.global	ti_sysbios_gates_GateHwi_Module__startupDone__S
	.global	ti_sysbios_gates_GateHwi_create
	.global	ti_sysbios_gates_GateHwi_Object__delete__S
	.global	ti_sysbios_gates_GateHwi_Params__init__S
	.global	ti_sysbios_gates_GateHwi_Handle__label__S
	.global	ti_sysbios_gates_GateHwi_query__E
	.global	ti_sysbios_gates_GateHwi_enter__E
	.global	ti_sysbios_gates_GateHwi_leave__E
	.global	xdc_runtime_SysMin_abort__E
	.global	xdc_runtime_SysMin_exit__E
	.global	xdc_runtime_SysMin_flush__E
	.global	xdc_runtime_SysMin_putch__E
	.global	xdc_runtime_SysMin_ready__E
	.global	xdc_runtime_Core_assignLabel__I
	.global	xdc_runtime_Core_assignParams__I
	.global	xdc_runtime_Core_createObject__I
	.global	ti_sysbios_knl_Event_Instance_init__E
	.global	xdc_runtime_Core_constructObject__I
	.global	xdc_runtime_Core_deleteObject__I
	.global	ti_uia_loggers_LoggerStopMode_Instance_init__E
	.global	ti_sysbios_gates_GateHwi_Object__create__S
	.global	ti_sysbios_gates_GateMutex_query__E
	.global	ti_sysbios_gates_GateMutex_enter__E
	.global	ti_sysbios_gates_GateMutex_leave__E
	.global	ti_sysbios_gates_GateMutex_Object__create__S
	.global	ti_sysbios_gates_GateMutex_Object__delete__S
	.global	ti_sysbios_gates_GateMutex_Handle__label__S
	.global	ti_sysbios_heaps_HeapMem_alloc__E
	.global	ti_sysbios_heaps_HeapMem_free__E
	.global	ti_sysbios_heaps_HeapMem_isBlocking__E
	.global	ti_sysbios_heaps_HeapMem_getStats__E
	.global	ti_sysbios_heaps_HeapMem_Object__create__S
	.global	ti_sysbios_heaps_HeapMem_Object__delete__S
	.global	ti_sysbios_heaps_HeapMem_Handle__label__S
	.global	ti_uia_loggers_LoggerStopMode_enable__E
	.global	ti_uia_loggers_LoggerStopMode_disable__E
	.global	ti_uia_loggers_LoggerStopMode_getTransferType__E
	.global	ti_uia_loggers_LoggerStopMode_getContents__E
	.global	ti_uia_loggers_LoggerStopMode_isEmpty__E
	.global	ti_uia_loggers_LoggerStopMode_getMaxLength__E
	.global	ti_uia_loggers_LoggerStopMode_getInstanceId__E
	.global	ti_uia_loggers_LoggerStopMode_getPriority__E
	.global	ti_uia_loggers_LoggerStopMode_setPriority__E
	.global	ti_uia_loggers_LoggerStopMode_reset__E
	.global	xdc_runtime_SysCallback_abort__E
	.global	xdc_runtime_SysCallback_exit__E
	.global	xdc_runtime_SysCallback_flush__E
	.global	xdc_runtime_SysCallback_putch__E
	.global	xdc_runtime_SysCallback_ready__E
	.global	xdc_runtime_Timestamp_get32__E
	.global	xdc_runtime_Timestamp_getFreq__E
	.global	ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I
	.global	ti_sysbios_family_arm_m3_Hwi_pendSV__I
	.global	ti_sysbios_family_arm_cc26xx_Timer_start__E
	.global	ti_sysbios_family_arm_cc26xx_Timer_initDevice__I
	.global	ti_sysbios_family_arm_cc26xx_Timer_setThreshold__I
	.global	ti_sysbios_family_arm_cc26xx_Timer_setNextTick__E
	.global	ti_sysbios_family_arm_cc26xx_Timer_getMaxTicks__E
	.global	ti_sysbios_family_arm_cc26xx_Timer_getCount64__E
	.global	ti_sysbios_family_arm_cc26xx_Timer_dynamicStub__E
	.global	ti_sysbios_family_arm_cc26xx_Timer_getCurrentTick__E
	.global	ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E
	.global	ti_sysbios_knl_Clock_workFuncDynamic__E
	.global	ti_sysbios_knl_Swi_restoreHwi__E
	.global	ti_sysbios_knl_Task_restoreHwi__E
	.global	ti_sysbios_knl_Clock_triggerFunc__I
	.global	Power_idleFunc
	.global	ti_sysbios_knl_Task_restore__E
	.global	ti_sysbios_knl_Idle_run__E
	.global	ti_sysbios_knl_Task_moduleStateCheck__I
	.global	ti_sysbios_knl_Task_getModuleStateCheckValue__I
	.global	ti_sysbios_knl_Task_objectCheck__I
	.global	ti_sysbios_knl_Task_getObjectCheckValue__I
	.global	xdc_runtime_Error_policySpin__E
	.global	ti_sysbios_heaps_HeapMem_initPrimary__I
	.global	ti_sysbios_family_arm_m3_Hwi_initNVIC__E
	.global	ti_sysbios_hal_Hwi_initStack
	.global	xdc_runtime_System_Module_startup__E
	.global	xdc_runtime_SysMin_Module_startup__E
	.global	ti_sysbios_knl_Clock_Module_startup__E
	.global	ti_sysbios_knl_Mailbox_Module_startup__E
	.global	ti_sysbios_knl_Swi_Module_startup__E
	.global	ti_sysbios_knl_Task_Module_startup__E
	.global	ti_sysbios_family_arm_m3_Hwi_Module_startup__E
	.global	ti_sysbios_family_arm_cc26xx_Timer_Module_startup__E
	.global	ti_sysbios_family_arm_cc26xx_TimestampProvider_Module_startup__E
	.global	ti_sysbios_hal_Hwi_Module_startup__E
	.global	ti_uia_loggers_LoggerStopMode_Module_startup__E
	.global	xdc_runtime_Startup_startMods__I
	.global	xdc_runtime_SysCallback_defaultAbort
	.global	xdc_runtime_SysCallback_defaultExit
	.global	xdc_runtime_SysCallback_defaultFlush
	.global	xdc_runtime_SysCallback_defaultPutch
	.global	xdc_runtime_SysCallback_defaultReady
	.global	xdc_runtime_System_abortSpin__E
	.global	xdc_runtime_System_exitSpin__E
	.global	xdc_runtime_Text_visitRope2__I
	.global	__xdc__init
	.global	memcpy

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
	.battr "TI", Tag_File, 1, Tag_FP_interface(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$237	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$237, DW_AT_byte_size(0x08)
$C$DW$2213	.dwtag  DW_TAG_member
	.dwattr $C$DW$2213, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2213, DW_AT_name("length")
	.dwattr $C$DW$2213, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2213, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$2213, DW_AT_decl_line(0x370)
	.dwattr $C$DW$2213, DW_AT_decl_column(0x16)

$C$DW$2214	.dwtag  DW_TAG_member
	.dwattr $C$DW$2214, DW_AT_type(*$C$DW$T$236)
	.dwattr $C$DW$2214, DW_AT_name("elem")
	.dwattr $C$DW$2214, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2214, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$2214, DW_AT_decl_line(0x370)
	.dwattr $C$DW$2214, DW_AT_decl_column(0x4a)

	.dwattr $C$DW$T$237, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$237, DW_AT_decl_line(0x370)
	.dwattr $C$DW$T$237, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$237

$C$DW$T$1271	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1271, DW_AT_name("CARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$1271, DW_AT_type(*$C$DW$T$237)
	.dwattr $C$DW$T$1271, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1271, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$1271, DW_AT_decl_line(0x370)
	.dwattr $C$DW$T$1271, DW_AT_decl_column(0x52)

$C$DW$T$1272	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1272, DW_AT_name("CT__ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$1272, DW_AT_type(*$C$DW$T$1271)
	.dwattr $C$DW$T$1272, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1272, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$1272, DW_AT_decl_line(0x372)
	.dwattr $C$DW$T$1272, DW_AT_decl_column(0x34)

$C$DW$T$1273	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1273, DW_AT_type(*$C$DW$T$1272)

$C$DW$T$1274	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1274, DW_AT_name("__TA_ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$1274, DW_AT_type(*$C$DW$T$1271)
	.dwattr $C$DW$T$1274, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1274, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$1274, DW_AT_decl_line(0x371)
	.dwattr $C$DW$T$1274, DW_AT_decl_column(0x34)


$C$DW$T$243	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$243, DW_AT_byte_size(0x08)
$C$DW$2215	.dwtag  DW_TAG_member
	.dwattr $C$DW$2215, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2215, DW_AT_name("length")
	.dwattr $C$DW$2215, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2215, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$2215, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$2215, DW_AT_decl_column(0x16)

$C$DW$2216	.dwtag  DW_TAG_member
	.dwattr $C$DW$2216, DW_AT_type(*$C$DW$T$242)
	.dwattr $C$DW$2216, DW_AT_name("elem")
	.dwattr $C$DW$2216, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2216, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$2216, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$2216, DW_AT_decl_column(0x41)

	.dwattr $C$DW$T$243, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$243, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$243, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$243

$C$DW$T$1275	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1275, DW_AT_name("CARRAY1_ti_sysbios_knl_Idle_funcList")
	.dwattr $C$DW$T$1275, DW_AT_type(*$C$DW$T$243)
	.dwattr $C$DW$T$1275, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1275, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$1275, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$1275, DW_AT_decl_column(0x49)

$C$DW$T$1276	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1276, DW_AT_name("CT__ti_sysbios_knl_Idle_funcList")
	.dwattr $C$DW$T$1276, DW_AT_type(*$C$DW$T$1275)
	.dwattr $C$DW$T$1276, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1276, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$1276, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$1276, DW_AT_decl_column(0x2e)

$C$DW$T$1277	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1277, DW_AT_type(*$C$DW$T$1276)

$C$DW$T$1278	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1278, DW_AT_name("__TA_ti_sysbios_knl_Idle_funcList")
	.dwattr $C$DW$T$1278, DW_AT_type(*$C$DW$T$1275)
	.dwattr $C$DW$T$1278, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1278, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$1278, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$1278, DW_AT_decl_column(0x2e)


$C$DW$T$247	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$247, DW_AT_byte_size(0x08)
$C$DW$2217	.dwtag  DW_TAG_member
	.dwattr $C$DW$2217, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2217, DW_AT_name("length")
	.dwattr $C$DW$2217, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2217, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$2217, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$2217, DW_AT_decl_column(0x16)

$C$DW$2218	.dwtag  DW_TAG_member
	.dwattr $C$DW$2218, DW_AT_type(*$C$DW$T$246)
	.dwattr $C$DW$2218, DW_AT_name("elem")
	.dwattr $C$DW$2218, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2218, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$2218, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$2218, DW_AT_decl_column(0x2e)

	.dwattr $C$DW$T$247, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$247, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$T$247, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$247

$C$DW$T$1279	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1279, DW_AT_name("CARRAY1_ti_sysbios_knl_Idle_coreList")
	.dwattr $C$DW$T$1279, DW_AT_type(*$C$DW$T$247)
	.dwattr $C$DW$T$1279, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1279, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$1279, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$T$1279, DW_AT_decl_column(0x36)

$C$DW$T$1280	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1280, DW_AT_name("CT__ti_sysbios_knl_Idle_coreList")
	.dwattr $C$DW$T$1280, DW_AT_type(*$C$DW$T$1279)
	.dwattr $C$DW$T$1280, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1280, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$1280, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$T$1280, DW_AT_decl_column(0x2e)

$C$DW$T$1281	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1281, DW_AT_type(*$C$DW$T$1280)

$C$DW$T$1282	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1282, DW_AT_name("__TA_ti_sysbios_knl_Idle_coreList")
	.dwattr $C$DW$T$1282, DW_AT_type(*$C$DW$T$1279)
	.dwattr $C$DW$T$1282, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1282, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$1282, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$T$1282, DW_AT_decl_column(0x2e)


$C$DW$T$251	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$251, DW_AT_byte_size(0x08)
$C$DW$2219	.dwtag  DW_TAG_member
	.dwattr $C$DW$2219, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2219, DW_AT_name("length")
	.dwattr $C$DW$2219, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2219, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$2219, DW_AT_decl_line(0x166)
	.dwattr $C$DW$2219, DW_AT_decl_column(0x16)

$C$DW$2220	.dwtag  DW_TAG_member
	.dwattr $C$DW$2220, DW_AT_type(*$C$DW$T$250)
	.dwattr $C$DW$2220, DW_AT_name("elem")
	.dwattr $C$DW$2220, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2220, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$2220, DW_AT_decl_line(0x166)
	.dwattr $C$DW$2220, DW_AT_decl_column(0x40)

	.dwattr $C$DW$T$251, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$251, DW_AT_decl_line(0x166)
	.dwattr $C$DW$T$251, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$251

$C$DW$T$1283	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1283, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1283, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$T$1283, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1283, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1283, DW_AT_decl_line(0x166)
	.dwattr $C$DW$T$1283, DW_AT_decl_column(0x48)

$C$DW$T$1284	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1284, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1284, DW_AT_type(*$C$DW$T$1283)
	.dwattr $C$DW$T$1284, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1284, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1284, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$1284, DW_AT_decl_column(0x2a)

$C$DW$T$1285	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1285, DW_AT_type(*$C$DW$T$1284)

$C$DW$T$1286	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1286, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1286, DW_AT_type(*$C$DW$T$1283)
	.dwattr $C$DW$T$1286, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1286, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1286, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$1286, DW_AT_decl_column(0x2a)


$C$DW$T$255	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$255, DW_AT_byte_size(0x08)
$C$DW$2221	.dwtag  DW_TAG_member
	.dwattr $C$DW$2221, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2221, DW_AT_name("length")
	.dwattr $C$DW$2221, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2221, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$2221, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$2221, DW_AT_decl_column(0x16)

$C$DW$2222	.dwtag  DW_TAG_member
	.dwattr $C$DW$2222, DW_AT_type(*$C$DW$T$254)
	.dwattr $C$DW$2222, DW_AT_name("elem")
	.dwattr $C$DW$2222, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2222, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2222, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$2222, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$2222, DW_AT_decl_column(0x41)

	.dwattr $C$DW$T$255, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$255, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$T$255, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$255

$C$DW$T$1287	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1287, DW_AT_name("CARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1287, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$T$1287, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1287, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1287, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$T$1287, DW_AT_decl_column(0x49)

$C$DW$T$1288	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1288, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1288, DW_AT_type(*$C$DW$T$1287)
	.dwattr $C$DW$T$1288, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1288, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1288, DW_AT_decl_line(0x29e)
	.dwattr $C$DW$T$1288, DW_AT_decl_column(0x2b)

$C$DW$T$1289	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1289, DW_AT_type(*$C$DW$T$1288)

$C$DW$T$1290	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1290, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1290, DW_AT_type(*$C$DW$T$1287)
	.dwattr $C$DW$T$1290, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1290, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1290, DW_AT_decl_line(0x29d)
	.dwattr $C$DW$T$1290, DW_AT_decl_column(0x2b)


$C$DW$T$259	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$259, DW_AT_byte_size(0x08)
$C$DW$2223	.dwtag  DW_TAG_member
	.dwattr $C$DW$2223, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2223, DW_AT_name("length")
	.dwattr $C$DW$2223, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2223, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$2223, DW_AT_decl_line(0x109)
	.dwattr $C$DW$2223, DW_AT_decl_column(0x16)

$C$DW$2224	.dwtag  DW_TAG_member
	.dwattr $C$DW$2224, DW_AT_type(*$C$DW$T$258)
	.dwattr $C$DW$2224, DW_AT_name("elem")
	.dwattr $C$DW$2224, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2224, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2224, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$2224, DW_AT_decl_line(0x109)
	.dwattr $C$DW$2224, DW_AT_decl_column(0x41)

	.dwattr $C$DW$T$259, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$259, DW_AT_decl_line(0x109)
	.dwattr $C$DW$T$259, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$259

$C$DW$T$1291	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1291, DW_AT_name("__CARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1291, DW_AT_type(*$C$DW$T$259)
	.dwattr $C$DW$T$1291, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1291, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1291, DW_AT_decl_line(0x109)
	.dwattr $C$DW$T$1291, DW_AT_decl_column(0x49)

$C$DW$T$1292	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1292, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1292, DW_AT_type(*$C$DW$T$1291)
	.dwattr $C$DW$T$1292, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1292, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1292, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$1292, DW_AT_decl_column(0x31)

$C$DW$T$1293	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1293, DW_AT_type(*$C$DW$T$1292)


$C$DW$T$260	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$260, DW_AT_byte_size(0x08)
$C$DW$2225	.dwtag  DW_TAG_member
	.dwattr $C$DW$2225, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2225, DW_AT_name("length")
	.dwattr $C$DW$2225, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2225, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$2225, DW_AT_decl_line(0x116)
	.dwattr $C$DW$2225, DW_AT_decl_column(0x16)

$C$DW$2226	.dwtag  DW_TAG_member
	.dwattr $C$DW$2226, DW_AT_type(*$C$DW$T$258)
	.dwattr $C$DW$2226, DW_AT_name("elem")
	.dwattr $C$DW$2226, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2226, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$2226, DW_AT_decl_line(0x116)
	.dwattr $C$DW$2226, DW_AT_decl_column(0x41)

	.dwattr $C$DW$T$260, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$260, DW_AT_decl_line(0x116)
	.dwattr $C$DW$T$260, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$260

$C$DW$T$1294	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1294, DW_AT_name("__CARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1294, DW_AT_type(*$C$DW$T$260)
	.dwattr $C$DW$T$1294, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1294, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1294, DW_AT_decl_line(0x116)
	.dwattr $C$DW$T$1294, DW_AT_decl_column(0x49)

$C$DW$T$1295	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1295, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1295, DW_AT_type(*$C$DW$T$1294)
	.dwattr $C$DW$T$1295, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1295, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1295, DW_AT_decl_line(0x118)
	.dwattr $C$DW$T$1295, DW_AT_decl_column(0x30)

$C$DW$T$1296	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1296, DW_AT_type(*$C$DW$T$1295)


$C$DW$T$266	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$266, DW_AT_byte_size(0x08)
$C$DW$2227	.dwtag  DW_TAG_member
	.dwattr $C$DW$2227, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$2227, DW_AT_name("actualBuf")
	.dwattr $C$DW$2227, DW_AT_TI_symbol_name("actualBuf")
	.dwattr $C$DW$2227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2227, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2227, DW_AT_decl_line(0xa8f)
	.dwattr $C$DW$2227, DW_AT_decl_column(0x0f)

$C$DW$2228	.dwtag  DW_TAG_member
	.dwattr $C$DW$2228, DW_AT_type(*$C$DW$T$265)
	.dwattr $C$DW$2228, DW_AT_name("size")
	.dwattr $C$DW$2228, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$2228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2228, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2228, DW_AT_decl_line(0xa90)
	.dwattr $C$DW$2228, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$266, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$266, DW_AT_decl_line(0xa8e)
	.dwattr $C$DW$T$266, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$266


$C$DW$T$267	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$267, DW_AT_byte_size(0x10)
$C$DW$2229	.dwtag  DW_TAG_member
	.dwattr $C$DW$2229, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$2229, DW_AT_name("__max_align1")
	.dwattr $C$DW$2229, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$2229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2229, DW_AT_decl_file("/Applications/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$2229, DW_AT_decl_line(0x70)
	.dwattr $C$DW$2229, DW_AT_decl_column(0x0c)

$C$DW$2230	.dwtag  DW_TAG_member
	.dwattr $C$DW$2230, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$2230, DW_AT_name("__max_align2")
	.dwattr $C$DW$2230, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$2230, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2230, DW_AT_decl_file("/Applications/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$2230, DW_AT_decl_line(0x71)
	.dwattr $C$DW$2230, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$267, DW_AT_decl_file("/Applications/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$267, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$267, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$267

$C$DW$T$1297	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1297, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$1297, DW_AT_type(*$C$DW$T$267)
	.dwattr $C$DW$T$1297, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1297, DW_AT_decl_file("/Applications/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$1297, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$1297, DW_AT_decl_column(0x03)


$C$DW$T$269	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$269, DW_AT_byte_size(0x08)
$C$DW$2231	.dwtag  DW_TAG_member
	.dwattr $C$DW$2231, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2231, DW_AT_name("length")
	.dwattr $C$DW$2231, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2231, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$2231, DW_AT_decl_line(0x36f)
	.dwattr $C$DW$2231, DW_AT_decl_column(0x16)

$C$DW$2232	.dwtag  DW_TAG_member
	.dwattr $C$DW$2232, DW_AT_type(*$C$DW$T$268)
	.dwattr $C$DW$2232, DW_AT_name("elem")
	.dwattr $C$DW$2232, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2232, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2232, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$2232, DW_AT_decl_line(0x36f)
	.dwattr $C$DW$2232, DW_AT_decl_column(0x44)

	.dwattr $C$DW$T$269, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$269, DW_AT_decl_line(0x36f)
	.dwattr $C$DW$T$269, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$269

$C$DW$T$1298	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1298, DW_AT_name("ARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$1298, DW_AT_type(*$C$DW$T$269)
	.dwattr $C$DW$T$1298, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1298, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$1298, DW_AT_decl_line(0x36f)
	.dwattr $C$DW$T$1298, DW_AT_decl_column(0x4c)


$C$DW$T$271	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$271, DW_AT_byte_size(0x08)
$C$DW$2233	.dwtag  DW_TAG_member
	.dwattr $C$DW$2233, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2233, DW_AT_name("length")
	.dwattr $C$DW$2233, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2233, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$2233, DW_AT_decl_line(0x165)
	.dwattr $C$DW$2233, DW_AT_decl_column(0x16)

$C$DW$2234	.dwtag  DW_TAG_member
	.dwattr $C$DW$2234, DW_AT_type(*$C$DW$T$270)
	.dwattr $C$DW$2234, DW_AT_name("elem")
	.dwattr $C$DW$2234, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2234, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$2234, DW_AT_decl_line(0x165)
	.dwattr $C$DW$2234, DW_AT_decl_column(0x3a)

	.dwattr $C$DW$T$271, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$271, DW_AT_decl_line(0x165)
	.dwattr $C$DW$T$271, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$271

$C$DW$T$1299	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1299, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1299, DW_AT_type(*$C$DW$T$271)
	.dwattr $C$DW$T$1299, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1299, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1299, DW_AT_decl_line(0x165)
	.dwattr $C$DW$T$1299, DW_AT_decl_column(0x42)


$C$DW$T$273	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$273, DW_AT_byte_size(0x08)
$C$DW$2235	.dwtag  DW_TAG_member
	.dwattr $C$DW$2235, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2235, DW_AT_name("length")
	.dwattr $C$DW$2235, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2235, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$2235, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$2235, DW_AT_decl_column(0x16)

$C$DW$2236	.dwtag  DW_TAG_member
	.dwattr $C$DW$2236, DW_AT_type(*$C$DW$T$272)
	.dwattr $C$DW$2236, DW_AT_name("elem")
	.dwattr $C$DW$2236, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2236, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2236, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$2236, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$2236, DW_AT_decl_column(0x3b)

	.dwattr $C$DW$T$273, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$273, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$273, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$273

$C$DW$T$1300	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1300, DW_AT_name("ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1300, DW_AT_type(*$C$DW$T$273)
	.dwattr $C$DW$T$1300, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1300, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1300, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$1300, DW_AT_decl_column(0x43)


$C$DW$T$275	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$275, DW_AT_byte_size(0x08)
$C$DW$2237	.dwtag  DW_TAG_member
	.dwattr $C$DW$2237, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2237, DW_AT_name("length")
	.dwattr $C$DW$2237, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2237, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$2237, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$2237, DW_AT_decl_column(0x16)

$C$DW$2238	.dwtag  DW_TAG_member
	.dwattr $C$DW$2238, DW_AT_type(*$C$DW$T$274)
	.dwattr $C$DW$2238, DW_AT_name("elem")
	.dwattr $C$DW$2238, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2238, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$2238, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$2238, DW_AT_decl_column(0x3b)

	.dwattr $C$DW$T$275, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$275, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$275, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$275

$C$DW$T$1301	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1301, DW_AT_name("ARRAY1_ti_sysbios_knl_Idle_funcList")
	.dwattr $C$DW$T$1301, DW_AT_type(*$C$DW$T$275)
	.dwattr $C$DW$T$1301, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1301, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$1301, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$1301, DW_AT_decl_column(0x43)


$C$DW$T$277	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$277, DW_AT_byte_size(0x08)
$C$DW$2239	.dwtag  DW_TAG_member
	.dwattr $C$DW$2239, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2239, DW_AT_name("length")
	.dwattr $C$DW$2239, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2239, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$2239, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$2239, DW_AT_decl_column(0x16)

$C$DW$2240	.dwtag  DW_TAG_member
	.dwattr $C$DW$2240, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$2240, DW_AT_name("elem")
	.dwattr $C$DW$2240, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2240, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2240, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$2240, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$2240, DW_AT_decl_column(0x28)

	.dwattr $C$DW$T$277, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$277, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$277, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$277

$C$DW$T$1302	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1302, DW_AT_name("ARRAY1_ti_sysbios_knl_Idle_coreList")
	.dwattr $C$DW$T$1302, DW_AT_type(*$C$DW$T$277)
	.dwattr $C$DW$T$1302, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1302, DW_AT_decl_file("/Users/hunteradams/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packages/ti/sysbios/knl/Idle.h")
	.dwattr $C$DW$T$1302, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$1302, DW_AT_decl_column(0x30)


$C$DW$T$278	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$278, DW_AT_byte_size(0x08)
$C$DW$2241	.dwtag  DW_TAG_member
	.dwattr $C$DW$2241, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2241, DW_AT_name("length")
	.dwattr $C$DW$2241, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2241, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$2241, DW_AT_decl_line(0x108)
	.dwattr $C$DW$2241, DW_AT_decl_column(0x16)

$C$DW$2242	.dwtag  DW_TAG_member
	.dwattr $C$DW$2242, DW_AT_type(*$C$DW$T$258)
	.dwattr $C$DW$2242, DW_AT_name("elem")
	.dwattr $C$DW$2242, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2242, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2242, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$2242, DW_AT_decl_line(0x108)
	.dwattr $C$DW$2242, DW_AT_decl_column(0x41)

	.dwattr $C$DW$T$278, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$278, DW_AT_decl_line(0x108)
	.dwattr $C$DW$T$278, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$278

$C$DW$T$1303	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1303, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1303, DW_AT_type(*$C$DW$T$278)
	.dwattr $C$DW$T$1303, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1303, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1303, DW_AT_decl_line(0x108)
	.dwattr $C$DW$T$1303, DW_AT_decl_column(0x49)

$C$DW$T$1304	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1304, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1304, DW_AT_type(*$C$DW$T$1303)
	.dwattr $C$DW$T$1304, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1304, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1304, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$T$1304, DW_AT_decl_column(0x30)


$C$DW$T$279	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$279, DW_AT_byte_size(0x08)
$C$DW$2243	.dwtag  DW_TAG_member
	.dwattr $C$DW$2243, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$2243, DW_AT_name("length")
	.dwattr $C$DW$2243, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$2243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2243, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$2243, DW_AT_decl_line(0x115)
	.dwattr $C$DW$2243, DW_AT_decl_column(0x16)

$C$DW$2244	.dwtag  DW_TAG_member
	.dwattr $C$DW$2244, DW_AT_type(*$C$DW$T$258)
	.dwattr $C$DW$2244, DW_AT_name("elem")
	.dwattr $C$DW$2244, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$2244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2244, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$2244, DW_AT_decl_line(0x115)
	.dwattr $C$DW$2244, DW_AT_decl_column(0x41)

	.dwattr $C$DW$T$279, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$279, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$279, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$279

$C$DW$T$1305	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1305, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1305, DW_AT_type(*$C$DW$T$279)
	.dwattr $C$DW$T$1305, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1305, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1305, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$1305, DW_AT_decl_column(0x49)

$C$DW$T$1306	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1306, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1306, DW_AT_type(*$C$DW$T$1305)
	.dwattr $C$DW$T$1306, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1306, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1306, DW_AT_decl_line(0x117)
	.dwattr $C$DW$T$1306, DW_AT_decl_column(0x2f)


$C$DW$T$282	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$282, DW_AT_byte_size(0x10)
$C$DW$2245	.dwtag  DW_TAG_member
	.dwattr $C$DW$2245, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2245, DW_AT_name("hdr")
	.dwattr $C$DW$2245, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2245, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2245, DW_AT_decl_line(0x79)
	.dwattr $C$DW$2245, DW_AT_decl_column(0x1f)

$C$DW$2246	.dwtag  DW_TAG_member
	.dwattr $C$DW$2246, DW_AT_type(*$C$DW$T$281)
	.dwattr $C$DW$2246, DW_AT_name("obj")
	.dwattr $C$DW$2246, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2246, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2246, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$2246, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$282, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$282, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$282, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$282

$C$DW$T$342	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$342, DW_AT_name("ti_sysbios_knl_Queue_Object2__")
	.dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$282)
	.dwattr $C$DW$T$342, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$342, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$342, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$342, DW_AT_decl_column(0x03)


$C$DW$T$284	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$284, DW_AT_byte_size(0x1c)
$C$DW$2247	.dwtag  DW_TAG_member
	.dwattr $C$DW$2247, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2247, DW_AT_name("hdr")
	.dwattr $C$DW$2247, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2247, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2247, DW_AT_decl_line(0x88)
	.dwattr $C$DW$2247, DW_AT_decl_column(0x1f)

$C$DW$2248	.dwtag  DW_TAG_member
	.dwattr $C$DW$2248, DW_AT_type(*$C$DW$T$283)
	.dwattr $C$DW$2248, DW_AT_name("obj")
	.dwattr $C$DW$2248, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2248, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2248, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2248, DW_AT_decl_line(0x89)
	.dwattr $C$DW$2248, DW_AT_decl_column(0x27)

	.dwattr $C$DW$T$284, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$284, DW_AT_decl_line(0x87)
	.dwattr $C$DW$T$284, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$284

$C$DW$T$344	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$344, DW_AT_name("ti_sysbios_knl_Semaphore_Object2__")
	.dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$284)
	.dwattr $C$DW$T$344, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$344, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$344, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$T$344, DW_AT_decl_column(0x03)


$C$DW$T$286	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$286, DW_AT_byte_size(0x24)
$C$DW$2249	.dwtag  DW_TAG_member
	.dwattr $C$DW$2249, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2249, DW_AT_name("hdr")
	.dwattr $C$DW$2249, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2249, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2249, DW_AT_decl_line(0x95)
	.dwattr $C$DW$2249, DW_AT_decl_column(0x1f)

$C$DW$2250	.dwtag  DW_TAG_member
	.dwattr $C$DW$2250, DW_AT_type(*$C$DW$T$285)
	.dwattr $C$DW$2250, DW_AT_name("obj")
	.dwattr $C$DW$2250, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2250, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2250, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2250, DW_AT_decl_line(0x96)
	.dwattr $C$DW$2250, DW_AT_decl_column(0x29)

	.dwattr $C$DW$T$286, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$286, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$286, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$286

$C$DW$T$330	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$330, DW_AT_name("ti_sysbios_gates_GateMutex_Object2__")
	.dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$286)
	.dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$330, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$330, DW_AT_decl_line(0x97)
	.dwattr $C$DW$T$330, DW_AT_decl_column(0x03)


$C$DW$T$288	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$288, DW_AT_byte_size(0x24)
$C$DW$2251	.dwtag  DW_TAG_member
	.dwattr $C$DW$2251, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2251, DW_AT_name("hdr")
	.dwattr $C$DW$2251, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2251, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2251, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$2251, DW_AT_decl_column(0x1f)

$C$DW$2252	.dwtag  DW_TAG_member
	.dwattr $C$DW$2252, DW_AT_type(*$C$DW$T$287)
	.dwattr $C$DW$2252, DW_AT_name("obj")
	.dwattr $C$DW$2252, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2252, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2252, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2252, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$2252, DW_AT_decl_column(0x2b)

	.dwattr $C$DW$T$288, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$288, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$288, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$288

$C$DW$T$1307	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1307, DW_AT_name("ti_sysbios_BIOS_RtsGateProxy_Object2__")
	.dwattr $C$DW$T$1307, DW_AT_type(*$C$DW$T$288)
	.dwattr $C$DW$T$1307, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1307, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1307, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$1307, DW_AT_decl_column(0x03)


$C$DW$T$290	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$290, DW_AT_byte_size(0x50)
$C$DW$2253	.dwtag  DW_TAG_member
	.dwattr $C$DW$2253, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2253, DW_AT_name("hdr")
	.dwattr $C$DW$2253, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2253, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2253, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$2253, DW_AT_decl_column(0x1f)

$C$DW$2254	.dwtag  DW_TAG_member
	.dwattr $C$DW$2254, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$2254, DW_AT_name("obj")
	.dwattr $C$DW$2254, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2254, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2254, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2254, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$2254, DW_AT_decl_column(0x31)

	.dwattr $C$DW$T$290, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$290, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$T$290, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$290

$C$DW$T$323	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$323, DW_AT_name("ti_sysbios_family_arm_cc26xx_Timer_Object2__")
	.dwattr $C$DW$T$323, DW_AT_type(*$C$DW$T$290)
	.dwattr $C$DW$T$323, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$323, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$323, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$T$323, DW_AT_decl_column(0x03)


$C$DW$T$292	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$292, DW_AT_byte_size(0x20)
$C$DW$2255	.dwtag  DW_TAG_member
	.dwattr $C$DW$2255, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2255, DW_AT_name("hdr")
	.dwattr $C$DW$2255, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2255, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2255, DW_AT_decl_line(0xea)
	.dwattr $C$DW$2255, DW_AT_decl_column(0x1f)

$C$DW$2256	.dwtag  DW_TAG_member
	.dwattr $C$DW$2256, DW_AT_type(*$C$DW$T$291)
	.dwattr $C$DW$2256, DW_AT_name("obj")
	.dwattr $C$DW$2256, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2256, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2256, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2256, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$2256, DW_AT_decl_column(0x2b)

	.dwattr $C$DW$T$292, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$292, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$292, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$292

$C$DW$T$326	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$326, DW_AT_name("ti_sysbios_family_arm_m3_Hwi_Object2__")
	.dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$292)
	.dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$326, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$326, DW_AT_decl_line(0xec)
	.dwattr $C$DW$T$326, DW_AT_decl_column(0x03)


$C$DW$T$294	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$294, DW_AT_byte_size(0x0c)
$C$DW$2257	.dwtag  DW_TAG_member
	.dwattr $C$DW$2257, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2257, DW_AT_name("hdr")
	.dwattr $C$DW$2257, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2257, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2257, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$2257, DW_AT_decl_column(0x1f)

$C$DW$2258	.dwtag  DW_TAG_member
	.dwattr $C$DW$2258, DW_AT_type(*$C$DW$T$293)
	.dwattr $C$DW$2258, DW_AT_name("obj")
	.dwattr $C$DW$2258, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2258, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2258, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$2258, DW_AT_decl_column(0x27)

	.dwattr $C$DW$T$294, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$294, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$294, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$294

$C$DW$T$328	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$328, DW_AT_name("ti_sysbios_gates_GateHwi_Object2__")
	.dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$328, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$328, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$T$328, DW_AT_decl_column(0x03)


$C$DW$T$296	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$296, DW_AT_byte_size(0x10)
$C$DW$2259	.dwtag  DW_TAG_member
	.dwattr $C$DW$2259, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2259, DW_AT_name("hdr")
	.dwattr $C$DW$2259, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2259, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2259, DW_AT_decl_line(0x134)
	.dwattr $C$DW$2259, DW_AT_decl_column(0x1f)

$C$DW$2260	.dwtag  DW_TAG_member
	.dwattr $C$DW$2260, DW_AT_type(*$C$DW$T$295)
	.dwattr $C$DW$2260, DW_AT_name("obj")
	.dwattr $C$DW$2260, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2260, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2260, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2260, DW_AT_decl_line(0x135)
	.dwattr $C$DW$2260, DW_AT_decl_column(0x21)

	.dwattr $C$DW$T$296, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$296, DW_AT_decl_line(0x133)
	.dwattr $C$DW$T$296, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$296

$C$DW$T$332	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$332, DW_AT_name("ti_sysbios_hal_Hwi_Object2__")
	.dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$296)
	.dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$332, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$332, DW_AT_decl_line(0x136)
	.dwattr $C$DW$T$332, DW_AT_decl_column(0x03)


$C$DW$T$298	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$298, DW_AT_byte_size(0x20)
$C$DW$2261	.dwtag  DW_TAG_member
	.dwattr $C$DW$2261, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2261, DW_AT_name("hdr")
	.dwattr $C$DW$2261, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2261, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2261, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$2261, DW_AT_decl_column(0x1f)

$C$DW$2262	.dwtag  DW_TAG_member
	.dwattr $C$DW$2262, DW_AT_type(*$C$DW$T$297)
	.dwattr $C$DW$2262, DW_AT_name("obj")
	.dwattr $C$DW$2262, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2262, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2262, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2262, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$2262, DW_AT_decl_column(0x2a)

	.dwattr $C$DW$T$298, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$298, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$T$298, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$298

$C$DW$T$1308	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1308, DW_AT_name("ti_sysbios_hal_Hwi_HwiProxy_Object2__")
	.dwattr $C$DW$T$1308, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$T$1308, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1308, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1308, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$T$1308, DW_AT_decl_column(0x03)


$C$DW$T$300	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$300, DW_AT_byte_size(0x20)
$C$DW$2263	.dwtag  DW_TAG_member
	.dwattr $C$DW$2263, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2263, DW_AT_name("hdr")
	.dwattr $C$DW$2263, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2263, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2263, DW_AT_decl_line(0x168)
	.dwattr $C$DW$2263, DW_AT_decl_column(0x1f)

$C$DW$2264	.dwtag  DW_TAG_member
	.dwattr $C$DW$2264, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$2264, DW_AT_name("obj")
	.dwattr $C$DW$2264, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2264, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2264, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2264, DW_AT_decl_line(0x169)
	.dwattr $C$DW$2264, DW_AT_decl_column(0x27)

	.dwattr $C$DW$T$300, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$300, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$300, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$300

$C$DW$T$334	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$334, DW_AT_name("ti_sysbios_heaps_HeapMem_Object2__")
	.dwattr $C$DW$T$334, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$T$334, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$334, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$334, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$T$334, DW_AT_decl_column(0x03)


$C$DW$T$302	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$302, DW_AT_byte_size(0x24)
$C$DW$2265	.dwtag  DW_TAG_member
	.dwattr $C$DW$2265, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2265, DW_AT_name("hdr")
	.dwattr $C$DW$2265, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2265, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2265, DW_AT_decl_line(0x180)
	.dwattr $C$DW$2265, DW_AT_decl_column(0x1f)

$C$DW$2266	.dwtag  DW_TAG_member
	.dwattr $C$DW$2266, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$2266, DW_AT_name("obj")
	.dwattr $C$DW$2266, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2266, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2266, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2266, DW_AT_decl_line(0x181)
	.dwattr $C$DW$2266, DW_AT_decl_column(0x38)

	.dwattr $C$DW$T$302, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$302, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$T$302, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$302

$C$DW$T$1309	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1309, DW_AT_name("ti_sysbios_heaps_HeapMem_Module_GateProxy_Object2__")
	.dwattr $C$DW$T$1309, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$T$1309, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1309, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1309, DW_AT_decl_line(0x182)
	.dwattr $C$DW$T$1309, DW_AT_decl_column(0x03)


$C$DW$T$304	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$304, DW_AT_byte_size(0x28)
$C$DW$2267	.dwtag  DW_TAG_member
	.dwattr $C$DW$2267, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2267, DW_AT_name("hdr")
	.dwattr $C$DW$2267, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2267, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2267, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$2267, DW_AT_decl_column(0x1f)

$C$DW$2268	.dwtag  DW_TAG_member
	.dwattr $C$DW$2268, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$2268, DW_AT_name("obj")
	.dwattr $C$DW$2268, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2268, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2268, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2268, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$2268, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$304, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$304, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$304, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$304

$C$DW$T$336	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$336, DW_AT_name("ti_sysbios_knl_Clock_Object2__")
	.dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$336, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$336, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$T$336, DW_AT_decl_column(0x03)


$C$DW$T$306	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$306, DW_AT_byte_size(0x50)
$C$DW$2269	.dwtag  DW_TAG_member
	.dwattr $C$DW$2269, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2269, DW_AT_name("hdr")
	.dwattr $C$DW$2269, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2269, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2269, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$2269, DW_AT_decl_column(0x1f)

$C$DW$2270	.dwtag  DW_TAG_member
	.dwattr $C$DW$2270, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$2270, DW_AT_name("obj")
	.dwattr $C$DW$2270, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2270, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2270, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2270, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$2270, DW_AT_decl_column(0x2e)

	.dwattr $C$DW$T$306, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$306, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$T$306, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$306

$C$DW$T$1310	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1310, DW_AT_name("ti_sysbios_knl_Clock_TimerProxy_Object2__")
	.dwattr $C$DW$T$1310, DW_AT_type(*$C$DW$T$306)
	.dwattr $C$DW$T$1310, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1310, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1310, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$T$1310, DW_AT_decl_column(0x03)


$C$DW$T$308	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$308, DW_AT_byte_size(0x14)
$C$DW$2271	.dwtag  DW_TAG_member
	.dwattr $C$DW$2271, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2271, DW_AT_name("hdr")
	.dwattr $C$DW$2271, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2271, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2271, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$2271, DW_AT_decl_column(0x1f)

$C$DW$2272	.dwtag  DW_TAG_member
	.dwattr $C$DW$2272, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$2272, DW_AT_name("obj")
	.dwattr $C$DW$2272, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2272, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2272, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$2272, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$308, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$308, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$T$308, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$308

$C$DW$T$338	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$338, DW_AT_name("ti_sysbios_knl_Event_Object2__")
	.dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$338, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$338, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$T$338, DW_AT_decl_column(0x03)


$C$DW$T$310	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$310, DW_AT_byte_size(0x58)
$C$DW$2273	.dwtag  DW_TAG_member
	.dwattr $C$DW$2273, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2273, DW_AT_name("hdr")
	.dwattr $C$DW$2273, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2273, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2273, DW_AT_decl_line(0x208)
	.dwattr $C$DW$2273, DW_AT_decl_column(0x1f)

$C$DW$2274	.dwtag  DW_TAG_member
	.dwattr $C$DW$2274, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$2274, DW_AT_name("obj")
	.dwattr $C$DW$2274, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2274, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2274, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2274, DW_AT_decl_line(0x209)
	.dwattr $C$DW$2274, DW_AT_decl_column(0x25)

	.dwattr $C$DW$T$310, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$310, DW_AT_decl_line(0x207)
	.dwattr $C$DW$T$310, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$310

$C$DW$T$340	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$340, DW_AT_name("ti_sysbios_knl_Mailbox_Object2__")
	.dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$310)
	.dwattr $C$DW$T$340, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$340, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$340, DW_AT_decl_line(0x20a)
	.dwattr $C$DW$T$340, DW_AT_decl_column(0x03)


$C$DW$T$312	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$312, DW_AT_byte_size(0x38)
$C$DW$2275	.dwtag  DW_TAG_member
	.dwattr $C$DW$2275, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2275, DW_AT_name("hdr")
	.dwattr $C$DW$2275, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2275, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2275, DW_AT_decl_line(0x248)
	.dwattr $C$DW$2275, DW_AT_decl_column(0x1f)

$C$DW$2276	.dwtag  DW_TAG_member
	.dwattr $C$DW$2276, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$2276, DW_AT_name("obj")
	.dwattr $C$DW$2276, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2276, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2276, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2276, DW_AT_decl_line(0x249)
	.dwattr $C$DW$2276, DW_AT_decl_column(0x21)

	.dwattr $C$DW$T$312, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$312, DW_AT_decl_line(0x247)
	.dwattr $C$DW$T$312, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$312

$C$DW$T$346	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$346, DW_AT_name("ti_sysbios_knl_Swi_Object2__")
	.dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$346, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$346, DW_AT_decl_line(0x24a)
	.dwattr $C$DW$T$346, DW_AT_decl_column(0x03)


$C$DW$T$314	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$314, DW_AT_byte_size(0x54)
$C$DW$2277	.dwtag  DW_TAG_member
	.dwattr $C$DW$2277, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2277, DW_AT_name("hdr")
	.dwattr $C$DW$2277, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2277, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2277, DW_AT_decl_line(0x274)
	.dwattr $C$DW$2277, DW_AT_decl_column(0x1f)

$C$DW$2278	.dwtag  DW_TAG_member
	.dwattr $C$DW$2278, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$2278, DW_AT_name("obj")
	.dwattr $C$DW$2278, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2278, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2278, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2278, DW_AT_decl_line(0x275)
	.dwattr $C$DW$2278, DW_AT_decl_column(0x22)

	.dwattr $C$DW$T$314, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$314, DW_AT_decl_line(0x273)
	.dwattr $C$DW$T$314, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$314

$C$DW$T$348	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$348, DW_AT_name("ti_sysbios_knl_Task_Object2__")
	.dwattr $C$DW$T$348, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$T$348, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$348, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$348, DW_AT_decl_line(0x276)
	.dwattr $C$DW$T$348, DW_AT_decl_column(0x03)


$C$DW$T$316	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$316, DW_AT_byte_size(0x3c)
$C$DW$2279	.dwtag  DW_TAG_member
	.dwattr $C$DW$2279, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2279, DW_AT_name("hdr")
	.dwattr $C$DW$2279, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2279, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2279, DW_AT_decl_line(0x2b3)
	.dwattr $C$DW$2279, DW_AT_decl_column(0x1f)

$C$DW$2280	.dwtag  DW_TAG_member
	.dwattr $C$DW$2280, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$2280, DW_AT_name("obj")
	.dwattr $C$DW$2280, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2280, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2280, DW_AT_decl_line(0x2b4)
	.dwattr $C$DW$2280, DW_AT_decl_column(0x2c)

	.dwattr $C$DW$T$316, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$316, DW_AT_decl_line(0x2b2)
	.dwattr $C$DW$T$316, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$316

$C$DW$T$350	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$350, DW_AT_name("ti_uia_loggers_LoggerStopMode_Object2__")
	.dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$350, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$350, DW_AT_decl_line(0x2b5)
	.dwattr $C$DW$T$350, DW_AT_decl_column(0x03)


$C$DW$T$318	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$318, DW_AT_byte_size(0x0c)
$C$DW$2281	.dwtag  DW_TAG_member
	.dwattr $C$DW$2281, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2281, DW_AT_name("hdr")
	.dwattr $C$DW$2281, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2281, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2281, DW_AT_decl_line(0x30a)
	.dwattr $C$DW$2281, DW_AT_decl_column(0x1f)

$C$DW$2282	.dwtag  DW_TAG_member
	.dwattr $C$DW$2282, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$2282, DW_AT_name("obj")
	.dwattr $C$DW$2282, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2282, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2282, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2282, DW_AT_decl_line(0x30b)
	.dwattr $C$DW$2282, DW_AT_decl_column(0x30)

	.dwattr $C$DW$T$318, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$318, DW_AT_decl_line(0x309)
	.dwattr $C$DW$T$318, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$318

$C$DW$T$1311	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1311, DW_AT_name("xdc_runtime_Main_Module_GateProxy_Object2__")
	.dwattr $C$DW$T$1311, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$T$1311, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1311, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1311, DW_AT_decl_line(0x30c)
	.dwattr $C$DW$T$1311, DW_AT_decl_column(0x03)


$C$DW$T$320	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$320, DW_AT_byte_size(0x20)
$C$DW$2283	.dwtag  DW_TAG_member
	.dwattr $C$DW$2283, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2283, DW_AT_name("hdr")
	.dwattr $C$DW$2283, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2283, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2283, DW_AT_decl_line(0x327)
	.dwattr $C$DW$2283, DW_AT_decl_column(0x1f)

$C$DW$2284	.dwtag  DW_TAG_member
	.dwattr $C$DW$2284, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$2284, DW_AT_name("obj")
	.dwattr $C$DW$2284, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2284, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2284, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2284, DW_AT_decl_line(0x328)
	.dwattr $C$DW$2284, DW_AT_decl_column(0x2b)

	.dwattr $C$DW$T$320, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$320, DW_AT_decl_line(0x326)
	.dwattr $C$DW$T$320, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$320

$C$DW$T$1312	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1312, DW_AT_name("xdc_runtime_Memory_HeapProxy_Object2__")
	.dwattr $C$DW$T$1312, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$T$1312, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1312, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1312, DW_AT_decl_line(0x329)
	.dwattr $C$DW$T$1312, DW_AT_decl_column(0x03)


$C$DW$T$322	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$322, DW_AT_byte_size(0x0c)
$C$DW$2285	.dwtag  DW_TAG_member
	.dwattr $C$DW$2285, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$2285, DW_AT_name("hdr")
	.dwattr $C$DW$2285, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$2285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2285, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2285, DW_AT_decl_line(0x358)
	.dwattr $C$DW$2285, DW_AT_decl_column(0x1f)

$C$DW$2286	.dwtag  DW_TAG_member
	.dwattr $C$DW$2286, DW_AT_type(*$C$DW$T$321)
	.dwattr $C$DW$2286, DW_AT_name("obj")
	.dwattr $C$DW$2286, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$2286, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2286, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2286, DW_AT_decl_line(0x359)
	.dwattr $C$DW$2286, DW_AT_decl_column(0x32)

	.dwattr $C$DW$T$322, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$322, DW_AT_decl_line(0x357)
	.dwattr $C$DW$T$322, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$322

$C$DW$T$1313	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1313, DW_AT_name("xdc_runtime_System_Module_GateProxy_Object2__")
	.dwattr $C$DW$T$1313, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$T$1313, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1313, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1313, DW_AT_decl_line(0x35a)
	.dwattr $C$DW$T$1313, DW_AT_decl_column(0x03)


$C$DW$T$325	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$325, DW_AT_byte_size(0x58)
$C$DW$2287	.dwtag  DW_TAG_member
	.dwattr $C$DW$2287, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$2287, DW_AT_name("s0")
	.dwattr $C$DW$2287, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2287, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2287, DW_AT_decl_line(0x2260)
	.dwattr $C$DW$2287, DW_AT_decl_column(0x3f)

$C$DW$2288	.dwtag  DW_TAG_member
	.dwattr $C$DW$2288, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2288, DW_AT_name("c")
	.dwattr $C$DW$2288, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2288, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$2288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2288, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2288, DW_AT_decl_line(0x2260)
	.dwattr $C$DW$2288, DW_AT_decl_column(0x48)

	.dwattr $C$DW$T$325, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$325, DW_AT_decl_line(0x2260)
	.dwattr $C$DW$T$325, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$325

$C$DW$T$1314	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1314, DW_AT_name("ti_sysbios_family_arm_cc26xx_Timer___S1")
	.dwattr $C$DW$T$1314, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$T$1314, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1314, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1314, DW_AT_decl_line(0x2260)
	.dwattr $C$DW$T$1314, DW_AT_decl_column(0x4d)


$C$DW$T$327	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$327, DW_AT_byte_size(0x24)
$C$DW$2289	.dwtag  DW_TAG_member
	.dwattr $C$DW$2289, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$2289, DW_AT_name("s0")
	.dwattr $C$DW$2289, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2289, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2289, DW_AT_decl_line(0x2273)
	.dwattr $C$DW$2289, DW_AT_decl_column(0x39)

$C$DW$2290	.dwtag  DW_TAG_member
	.dwattr $C$DW$2290, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2290, DW_AT_name("c")
	.dwattr $C$DW$2290, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2290, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$2290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2290, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2290, DW_AT_decl_line(0x2273)
	.dwattr $C$DW$2290, DW_AT_decl_column(0x42)

	.dwattr $C$DW$T$327, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$327, DW_AT_decl_line(0x2273)
	.dwattr $C$DW$T$327, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$327

$C$DW$T$1315	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1315, DW_AT_name("ti_sysbios_family_arm_m3_Hwi___S1")
	.dwattr $C$DW$T$1315, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$T$1315, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1315, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1315, DW_AT_decl_line(0x2273)
	.dwattr $C$DW$T$1315, DW_AT_decl_column(0x47)


$C$DW$T$329	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$329, DW_AT_byte_size(0x10)
$C$DW$2291	.dwtag  DW_TAG_member
	.dwattr $C$DW$2291, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$2291, DW_AT_name("s0")
	.dwattr $C$DW$2291, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2291, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2291, DW_AT_decl_line(0x2286)
	.dwattr $C$DW$2291, DW_AT_decl_column(0x35)

$C$DW$2292	.dwtag  DW_TAG_member
	.dwattr $C$DW$2292, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2292, DW_AT_name("c")
	.dwattr $C$DW$2292, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2292, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$2292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2292, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2292, DW_AT_decl_line(0x2286)
	.dwattr $C$DW$2292, DW_AT_decl_column(0x3e)

	.dwattr $C$DW$T$329, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$329, DW_AT_decl_line(0x2286)
	.dwattr $C$DW$T$329, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$329

$C$DW$T$1316	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1316, DW_AT_name("ti_sysbios_gates_GateHwi___S1")
	.dwattr $C$DW$T$1316, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1316, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1316, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1316, DW_AT_decl_line(0x2286)
	.dwattr $C$DW$T$1316, DW_AT_decl_column(0x43)


$C$DW$T$331	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$331, DW_AT_byte_size(0x28)
$C$DW$2293	.dwtag  DW_TAG_member
	.dwattr $C$DW$2293, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$2293, DW_AT_name("s0")
	.dwattr $C$DW$2293, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2293, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2293, DW_AT_decl_line(0x2299)
	.dwattr $C$DW$2293, DW_AT_decl_column(0x37)

$C$DW$2294	.dwtag  DW_TAG_member
	.dwattr $C$DW$2294, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2294, DW_AT_name("c")
	.dwattr $C$DW$2294, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2294, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$2294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2294, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2294, DW_AT_decl_line(0x2299)
	.dwattr $C$DW$2294, DW_AT_decl_column(0x40)

	.dwattr $C$DW$T$331, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$331, DW_AT_decl_line(0x2299)
	.dwattr $C$DW$T$331, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$331

$C$DW$T$1317	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1317, DW_AT_name("ti_sysbios_gates_GateMutex___S1")
	.dwattr $C$DW$T$1317, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$T$1317, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1317, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1317, DW_AT_decl_line(0x2299)
	.dwattr $C$DW$T$1317, DW_AT_decl_column(0x45)


$C$DW$T$333	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$333, DW_AT_byte_size(0x14)
$C$DW$2295	.dwtag  DW_TAG_member
	.dwattr $C$DW$2295, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$2295, DW_AT_name("s0")
	.dwattr $C$DW$2295, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2295, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2295, DW_AT_decl_line(0x22ac)
	.dwattr $C$DW$2295, DW_AT_decl_column(0x2f)

$C$DW$2296	.dwtag  DW_TAG_member
	.dwattr $C$DW$2296, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2296, DW_AT_name("c")
	.dwattr $C$DW$2296, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2296, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$2296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2296, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2296, DW_AT_decl_line(0x22ac)
	.dwattr $C$DW$2296, DW_AT_decl_column(0x38)

	.dwattr $C$DW$T$333, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$333, DW_AT_decl_line(0x22ac)
	.dwattr $C$DW$T$333, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$333

$C$DW$T$1318	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1318, DW_AT_name("ti_sysbios_hal_Hwi___S1")
	.dwattr $C$DW$T$1318, DW_AT_type(*$C$DW$T$333)
	.dwattr $C$DW$T$1318, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1318, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1318, DW_AT_decl_line(0x22ac)
	.dwattr $C$DW$T$1318, DW_AT_decl_column(0x3d)


$C$DW$T$335	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$335, DW_AT_byte_size(0x24)
$C$DW$2297	.dwtag  DW_TAG_member
	.dwattr $C$DW$2297, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$2297, DW_AT_name("s0")
	.dwattr $C$DW$2297, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2297, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2297, DW_AT_decl_line(0x22bf)
	.dwattr $C$DW$2297, DW_AT_decl_column(0x35)

$C$DW$2298	.dwtag  DW_TAG_member
	.dwattr $C$DW$2298, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2298, DW_AT_name("c")
	.dwattr $C$DW$2298, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2298, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$2298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2298, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2298, DW_AT_decl_line(0x22bf)
	.dwattr $C$DW$2298, DW_AT_decl_column(0x3e)

	.dwattr $C$DW$T$335, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$335, DW_AT_decl_line(0x22bf)
	.dwattr $C$DW$T$335, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$335

$C$DW$T$1319	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1319, DW_AT_name("ti_sysbios_heaps_HeapMem___S1")
	.dwattr $C$DW$T$1319, DW_AT_type(*$C$DW$T$335)
	.dwattr $C$DW$T$1319, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1319, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1319, DW_AT_decl_line(0x22bf)
	.dwattr $C$DW$T$1319, DW_AT_decl_column(0x43)


$C$DW$T$337	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$337, DW_AT_byte_size(0x2c)
$C$DW$2299	.dwtag  DW_TAG_member
	.dwattr $C$DW$2299, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$2299, DW_AT_name("s0")
	.dwattr $C$DW$2299, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2299, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2299, DW_AT_decl_line(0x22d2)
	.dwattr $C$DW$2299, DW_AT_decl_column(0x31)

$C$DW$2300	.dwtag  DW_TAG_member
	.dwattr $C$DW$2300, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2300, DW_AT_name("c")
	.dwattr $C$DW$2300, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2300, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$2300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2300, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2300, DW_AT_decl_line(0x22d2)
	.dwattr $C$DW$2300, DW_AT_decl_column(0x3a)

	.dwattr $C$DW$T$337, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$337, DW_AT_decl_line(0x22d2)
	.dwattr $C$DW$T$337, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$337

$C$DW$T$1320	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1320, DW_AT_name("ti_sysbios_knl_Clock___S1")
	.dwattr $C$DW$T$1320, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$T$1320, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1320, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1320, DW_AT_decl_line(0x22d2)
	.dwattr $C$DW$T$1320, DW_AT_decl_column(0x3f)


$C$DW$T$339	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$339, DW_AT_byte_size(0x18)
$C$DW$2301	.dwtag  DW_TAG_member
	.dwattr $C$DW$2301, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$2301, DW_AT_name("s0")
	.dwattr $C$DW$2301, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2301, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2301, DW_AT_decl_line(0x22e5)
	.dwattr $C$DW$2301, DW_AT_decl_column(0x31)

$C$DW$2302	.dwtag  DW_TAG_member
	.dwattr $C$DW$2302, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2302, DW_AT_name("c")
	.dwattr $C$DW$2302, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2302, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$2302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2302, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2302, DW_AT_decl_line(0x22e5)
	.dwattr $C$DW$2302, DW_AT_decl_column(0x3a)

	.dwattr $C$DW$T$339, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$339, DW_AT_decl_line(0x22e5)
	.dwattr $C$DW$T$339, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$339

$C$DW$T$1321	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1321, DW_AT_name("ti_sysbios_knl_Event___S1")
	.dwattr $C$DW$T$1321, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$T$1321, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1321, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1321, DW_AT_decl_line(0x22e5)
	.dwattr $C$DW$T$1321, DW_AT_decl_column(0x3f)


$C$DW$T$341	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$341, DW_AT_byte_size(0x5c)
$C$DW$2303	.dwtag  DW_TAG_member
	.dwattr $C$DW$2303, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$2303, DW_AT_name("s0")
	.dwattr $C$DW$2303, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2303, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2303, DW_AT_decl_line(0x22f8)
	.dwattr $C$DW$2303, DW_AT_decl_column(0x33)

$C$DW$2304	.dwtag  DW_TAG_member
	.dwattr $C$DW$2304, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2304, DW_AT_name("c")
	.dwattr $C$DW$2304, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2304, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$2304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2304, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2304, DW_AT_decl_line(0x22f8)
	.dwattr $C$DW$2304, DW_AT_decl_column(0x3c)

	.dwattr $C$DW$T$341, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$341, DW_AT_decl_line(0x22f8)
	.dwattr $C$DW$T$341, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$341

$C$DW$T$1322	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1322, DW_AT_name("ti_sysbios_knl_Mailbox___S1")
	.dwattr $C$DW$T$1322, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$T$1322, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1322, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1322, DW_AT_decl_line(0x22f8)
	.dwattr $C$DW$T$1322, DW_AT_decl_column(0x41)


$C$DW$T$343	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$343, DW_AT_byte_size(0x14)
$C$DW$2305	.dwtag  DW_TAG_member
	.dwattr $C$DW$2305, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$2305, DW_AT_name("s0")
	.dwattr $C$DW$2305, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2305, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2305, DW_AT_decl_line(0x230b)
	.dwattr $C$DW$2305, DW_AT_decl_column(0x31)

$C$DW$2306	.dwtag  DW_TAG_member
	.dwattr $C$DW$2306, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2306, DW_AT_name("c")
	.dwattr $C$DW$2306, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$2306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2306, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2306, DW_AT_decl_line(0x230b)
	.dwattr $C$DW$2306, DW_AT_decl_column(0x3a)

	.dwattr $C$DW$T$343, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$343, DW_AT_decl_line(0x230b)
	.dwattr $C$DW$T$343, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$343

$C$DW$T$1323	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1323, DW_AT_name("ti_sysbios_knl_Queue___S1")
	.dwattr $C$DW$T$1323, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$T$1323, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1323, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1323, DW_AT_decl_line(0x230b)
	.dwattr $C$DW$T$1323, DW_AT_decl_column(0x3f)


$C$DW$T$345	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$345, DW_AT_byte_size(0x20)
$C$DW$2307	.dwtag  DW_TAG_member
	.dwattr $C$DW$2307, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$2307, DW_AT_name("s0")
	.dwattr $C$DW$2307, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2307, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2307, DW_AT_decl_line(0x231e)
	.dwattr $C$DW$2307, DW_AT_decl_column(0x35)

$C$DW$2308	.dwtag  DW_TAG_member
	.dwattr $C$DW$2308, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2308, DW_AT_name("c")
	.dwattr $C$DW$2308, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2308, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$2308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2308, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2308, DW_AT_decl_line(0x231e)
	.dwattr $C$DW$2308, DW_AT_decl_column(0x3e)

	.dwattr $C$DW$T$345, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$345, DW_AT_decl_line(0x231e)
	.dwattr $C$DW$T$345, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$345

$C$DW$T$1324	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1324, DW_AT_name("ti_sysbios_knl_Semaphore___S1")
	.dwattr $C$DW$T$1324, DW_AT_type(*$C$DW$T$345)
	.dwattr $C$DW$T$1324, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1324, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1324, DW_AT_decl_line(0x231e)
	.dwattr $C$DW$T$1324, DW_AT_decl_column(0x43)


$C$DW$T$347	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$347, DW_AT_byte_size(0x3c)
$C$DW$2309	.dwtag  DW_TAG_member
	.dwattr $C$DW$2309, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$2309, DW_AT_name("s0")
	.dwattr $C$DW$2309, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2309, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2309, DW_AT_decl_line(0x2331)
	.dwattr $C$DW$2309, DW_AT_decl_column(0x2f)

$C$DW$2310	.dwtag  DW_TAG_member
	.dwattr $C$DW$2310, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2310, DW_AT_name("c")
	.dwattr $C$DW$2310, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2310, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$2310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2310, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2310, DW_AT_decl_line(0x2331)
	.dwattr $C$DW$2310, DW_AT_decl_column(0x38)

	.dwattr $C$DW$T$347, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$347, DW_AT_decl_line(0x2331)
	.dwattr $C$DW$T$347, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$347

$C$DW$T$1325	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1325, DW_AT_name("ti_sysbios_knl_Swi___S1")
	.dwattr $C$DW$T$1325, DW_AT_type(*$C$DW$T$347)
	.dwattr $C$DW$T$1325, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1325, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1325, DW_AT_decl_line(0x2331)
	.dwattr $C$DW$T$1325, DW_AT_decl_column(0x3d)


$C$DW$T$349	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$349, DW_AT_byte_size(0x58)
$C$DW$2311	.dwtag  DW_TAG_member
	.dwattr $C$DW$2311, DW_AT_type(*$C$DW$T$348)
	.dwattr $C$DW$2311, DW_AT_name("s0")
	.dwattr $C$DW$2311, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2311, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2311, DW_AT_decl_line(0x2344)
	.dwattr $C$DW$2311, DW_AT_decl_column(0x30)

$C$DW$2312	.dwtag  DW_TAG_member
	.dwattr $C$DW$2312, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2312, DW_AT_name("c")
	.dwattr $C$DW$2312, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2312, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$2312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2312, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2312, DW_AT_decl_line(0x2344)
	.dwattr $C$DW$2312, DW_AT_decl_column(0x39)

	.dwattr $C$DW$T$349, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$349, DW_AT_decl_line(0x2344)
	.dwattr $C$DW$T$349, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$349

$C$DW$T$1326	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1326, DW_AT_name("ti_sysbios_knl_Task___S1")
	.dwattr $C$DW$T$1326, DW_AT_type(*$C$DW$T$349)
	.dwattr $C$DW$T$1326, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1326, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1326, DW_AT_decl_line(0x2344)
	.dwattr $C$DW$T$1326, DW_AT_decl_column(0x3e)


$C$DW$T$351	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$351, DW_AT_byte_size(0x40)
$C$DW$2313	.dwtag  DW_TAG_member
	.dwattr $C$DW$2313, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$2313, DW_AT_name("s0")
	.dwattr $C$DW$2313, DW_AT_TI_symbol_name("s0")
	.dwattr $C$DW$2313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2313, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2313, DW_AT_decl_line(0x2357)
	.dwattr $C$DW$2313, DW_AT_decl_column(0x3a)

$C$DW$2314	.dwtag  DW_TAG_member
	.dwattr $C$DW$2314, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$2314, DW_AT_name("c")
	.dwattr $C$DW$2314, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2314, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$2314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2314, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2314, DW_AT_decl_line(0x2357)
	.dwattr $C$DW$2314, DW_AT_decl_column(0x43)

	.dwattr $C$DW$T$351, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$351, DW_AT_decl_line(0x2357)
	.dwattr $C$DW$T$351, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$351

$C$DW$T$1327	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1327, DW_AT_name("ti_uia_loggers_LoggerStopMode___S1")
	.dwattr $C$DW$T$1327, DW_AT_type(*$C$DW$T$351)
	.dwattr $C$DW$T$1327, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1327, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1327, DW_AT_decl_line(0x2357)
	.dwattr $C$DW$T$1327, DW_AT_decl_column(0x48)


$C$DW$T$357	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$357, DW_AT_byte_size(0x04)
$C$DW$2315	.dwtag  DW_TAG_member
	.dwattr $C$DW$2315, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$2315, DW_AT_name("f")
	.dwattr $C$DW$2315, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$2315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2315, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/std.h")
	.dwattr $C$DW$2315, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$2315, DW_AT_decl_column(0x0f)

$C$DW$2316	.dwtag  DW_TAG_member
	.dwattr $C$DW$2316, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$2316, DW_AT_name("a")
	.dwattr $C$DW$2316, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$2316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2316, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/std.h")
	.dwattr $C$DW$2316, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$2316, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$357, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/std.h")
	.dwattr $C$DW$T$357, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$357, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$357

$C$DW$T$1328	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1328, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$1328, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$T$1328, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1328, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/std.h")
	.dwattr $C$DW$T$1328, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1328, DW_AT_decl_column(0x03)


$C$DW$T$364	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$364, DW_AT_name("Header")
	.dwattr $C$DW$T$364, DW_AT_byte_size(0x08)
$C$DW$2317	.dwtag  DW_TAG_member
	.dwattr $C$DW$2317, DW_AT_type(*$C$DW$T$266)
	.dwattr $C$DW$2317, DW_AT_name("header")
	.dwattr $C$DW$2317, DW_AT_TI_symbol_name("header")
	.dwattr $C$DW$2317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2317, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2317, DW_AT_decl_line(0xa91)
	.dwattr $C$DW$2317, DW_AT_decl_column(0x07)

$C$DW$2318	.dwtag  DW_TAG_member
	.dwattr $C$DW$2318, DW_AT_type(*$C$DW$T$363)
	.dwattr $C$DW$2318, DW_AT_name("pad")
	.dwattr $C$DW$2318, DW_AT_TI_symbol_name("pad")
	.dwattr $C$DW$2318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2318, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$2318, DW_AT_decl_line(0xa92)
	.dwattr $C$DW$2318, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$364, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$364, DW_AT_decl_line(0xa8d)
	.dwattr $C$DW$T$364, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$364

$C$DW$T$1329	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1329, DW_AT_name("Header")
	.dwattr $C$DW$T$1329, DW_AT_type(*$C$DW$T$364)
	.dwattr $C$DW$T$1329, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1329, DW_AT_decl_file("package/cfg/hello_pem3.c")
	.dwattr $C$DW$T$1329, DW_AT_decl_line(0xa93)
	.dwattr $C$DW$T$1329, DW_AT_decl_column(0x03)

$C$DW$T$1330	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1330, DW_AT_type(*$C$DW$T$1329)
	.dwattr $C$DW$T$1330, DW_AT_address_class(0x20)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)

$C$DW$T$1338	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1338, DW_AT_type(*$C$DW$T$3)

$C$DW$T$1339	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1339, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$1339, DW_AT_address_class(0x20)

$C$DW$T$261	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$261, DW_AT_name("xdc_Ptr")
	.dwattr $C$DW$T$261, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$261, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$261, DW_AT_decl_file("/Applications/ti/xdctools_3_50_02_20_core/packages/xdc/std.h")
	.dwattr $C$DW$T$261, DW_AT_decl_line(0x2e)
